const _ = require("lodash");

/*
 * 返回对象在指定路径上的属性值；
 * 接受 3 个参数：'对象'，'属性路径'，'默认值[可选]'；
 * 可以通过第三个参数指定默认值，当按照指定路径查找的属性值为 undefined 时，则返回默认值；
 * --------------------------------------------------
 */

const obj = {
  a: [
    {
      b: {
        c: 18
      }
    }
  ]
};

/*
 * 属性路径（path）支持数组索引的方式；
 * --------------------------------------------------
 */
/* 18 */
console.log(_.get(obj, "a[0].b.c"));
console.log("----------");

/*
 * 如果根据属性路径找不到属性时，直接返回 undefined；
 * --------------------------------------------------
 */
/* undefined */
console.log(_.get(obj, "a.b.c.d"));
console.log("----------");

/*
 * 可以指定默认值，当找不到属性或找到的值为 undefined 时，则返回该默认值；
 * --------------------------------------------------
 */
/* tom */
console.log(_.get(obj, "a.b.c.d.e.f", "tom"));
console.log("----------");
