const _ = require("lodash");

/*
 * 接收 1 个参数：'数组'
 * 将'数组'平化一层，返回平化后的新数组，'数组'不变；
 * --------------------------------------------------
 */

/*
 * 只平化一层；
 * --------------------------------------------------
 */
console.log("----------: one level");
/* [ 1, 2, [ 3, [ 4 ] ], 5 ] */
console.log(_.flatten([1, [2, [3, [4]]], 5]));

/*
 * 返回新的数组，原'数组'不变；
 * --------------------------------------------------
 */
console.log("----------: return new array");
const array02 = [[1], [2], [3]];
/* [ 1, 2, 3 ] */
console.log(_.flatten(array02));
/* [ [ 1 ], [ 2 ], [ 3 ] ] */
console.log(array02);
