const _ = require("lodash");

/*
 * 接收 多 个参数：'数组'，'值（多个）'；
 * 从'数组'中移除'值'；
 * --------------------------------------------------
 */

/*
 * 返回移除所有'值'后的'数组'；
 * --------------------------------------------------
 */
console.log("----------: 基本用法");
const array01 = [1, 2, 3, 4, 5, 4, 3, 2, 1];
/* [ 3, 4, 5, 4, 3 ] */
console.log(_.pull(array01, 1, 2));

/*
 * '数组'会被修改（跟 _.without 的区别）；
 * --------------------------------------------------
 */
console.log("----------: mutate array");
const array02 = [1, 2, 3, 4, 5, 4, 3, 2, 1];
/* true */
console.log(array02 === _.pull(array02, 1, 2));
