const _ = require("lodash");

/*
 * 接收 3 个参数：'执行函数'，'延迟时间'，'参数列表（可选）'；
 * 延迟'延迟时间（单位：毫秒）'执行'执行函数'，可以传递额外的参数到'执行函数'；
 * --------------------------------------------------
 */

/*
 *
 * --------------------------------------------------
 */
_.delay(
  (x, y) => {
    console.log("----------: 基本用法");
    console.log(`${x} + ${y} =`, x + y);
  },
  1000,
  1,
  1
);

/*
 * 返回计时器的 ID；
 * --------------------------------------------------
 */
const timer = _.delay(
  (x, y) => {
    console.log("----------: return timer id");
    console.log(`${x} + ${y} =`, x + y);
  },
  1000,
  1,
  1
);
console.log(timer);
